tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf26k40_tdd.h
#define PSCNT11                       522
#define WDTPSCNT11                    523
#define PSCNT12                       524
#define WDTPSCNT12                    525
#define PSCNT13                       526
#define WDTPSCNT13                    527
#define PSCNT14                       528
#define WDTPSCNT14                    529
#define PSCNT15                       530
#define WDTPSCNT15                    531
#define PSCNT16                       532
#define WDTPSCNT16                    533
#define WDTPSCNT17                    534
#define PSCNT17                       535
#define STATE                         536
#define WDTSTATE                      537
#define WDTTMR                        538
#define WDTTMR0                       539
#define WDTTMR1                       540
#define WDTTMR2                       541
#define WDTTMR3                       542
#define WDTTMR4                       543
#define CPUDOZE                       544
#define DOZE0                         545
#define DOZE                          546
#define DOZE1                         547
#define DOZE2                         548
#define DOE                           549
#define ROI                           550
#define DOZEN                         551
#define IDLEN                         552
#define OSCCON1                       553
#define NDIV0                         554
#define NDIV                          555
#define NDIV1                         556
#define NDIV2                         557
#define NDIV3                         558
#define NOSC0                         559
#define NOSC                          560
#define NOSC1                         561
#define NOSC2                         562
#define OSCCON2                       563
#define CDIV0                         564
#define CDIV                          565
#define CDIV1                         566
#define CDIV2                         567
#define CDIV3                         568
#define COSC                          569
#define COSC0                         570
#define COSC1                         571
#define COSC2                         572
#define OSCCON3                       573
#define NOSCR                         574
#define ORDY                          575
#define SOSCPWR                       576
#define CSWHOLD                       577
#define OSCSTAT                       578
#define PLLR                          579
#define ADOR                          580
#define SOR                           581
#define LFOR                          582
#define MFOR                          583
#define HFOR                          584
#define EXTOR                         585
#define OSCEN                         586
#define ADOEN                         587
#define SOSCEN                        588
#define LFOEN                         589
#define MFOEN                         590
#define HFOEN                         591
#define EXTOEN                        592
#define OSCTUNE                       593
#define TUN0                          594
#define TUN                           595
#define TUN1                          596
#define TUN2                          597
#define TUN3                          598
#define TUN4                          599
#define TUN5                          600
#define OSCFRQ                        601
#define HFFRQ                         602
#define FRQ0                          603
#define FRQ1                          604
#define FRQ2                          605
#define FRQ3                          606
#define BORCON                        607
#define BORRDY                        608
#define SBOREN                        609
#define PMD0                          610
#define IOCMD                         611
#define CLKRMD                        612
#define SPI1MD                        613
#define SPI2MD                        614
#define NVMMD                         615
#define SCANMD                        616
#define CRCMD                         617
#define HLVDMD                        618
#define FVRMD                         619
#define SYSCMD                        620
#define PMD1                          621
#define EMBMD                         622
#define TMR0MD                        623
#define TMR1MD                        624
#define TMR2MD                        625
#define TMR3MD                        626
#define TMR4MD                        627
#define TMR5MD                        628
#define TMR6MD                        629
#define PMD2                          630
#define ZCDMD                         631
#define CMP1MD                        632
#define CMP2MD                        633
#define ADCMD                         634
#define DACMD                         635
#define PMD3                          636
#define CCP1MD                        637
#define CCP2MD                        638
#define PWM3MD                        639
#define PWM4MD                        640
#define PMD4                          641
#define CWGMD                         642
#define CWG1MD                        643
#define MSSP1MD                       644
#define MSSP2MD                       645
#define UART1MD                       646
#define UART2MD                       647
#define PMD5                          648
#define DSMMD                         649
#define RA0PPS                        650
#define RA0PPS0                       651
#define RA0PPS1                       652
#define RA0PPS2                       653
#define RA0PPS3                       654
#define RA0PPS4                       655
#define RA1PPS                        656
#define RA1PPS0                       657
#define RA1PPS1                       658
#define RA1PPS2                       659
#define RA1PPS3                       660
#define RA1PPS4                       661
#define RA2PPS                        662
#define RA2PPS0                       663
#define RA2PPS1                       664
#define RA2PPS2                       665
#define RA2PPS3                       666
#define RA2PPS4                       667
#define RA3PPS                        668
#define RA3PPS0                       669
#define RA3PPS1                       670
#define RA3PPS2                       671
#define RA3PPS3                       672
#define RA3PPS4                       673
#define RA4PPS                        674
#define RA4PPS0                       675
#define RA4PPS1                       676
#define RA4PPS2                       677
#define RA4PPS3                       678
#define RA4PPS4                       679
#define RA5PPS                        680
#define RA5PPS0                       681
#define RA5PPS1                       682
#define RA5PPS2                       683
#define RA5PPS3                       684
#define RA5PPS4                       685
#define RA6PPS                        686
#define RA6PPS0                       687
#define RA6PPS1                       688
#define RA6PPS2                       689
#define RA6PPS3                       690
#define RA6PPS4                       691
#define RA7PPS                        692
#define RA7PPS0                       693
#define RA7PPS1                       694
#define RA7PPS2                       695
#define RA7PPS3                       696
#define RA7PPS4                       697
#define RB0PPS                        698
#define RB0PPS0                       699
#define RB0PPS1                       700
#define RB0PPS2                       701
#define RB0PPS3                       702
#define RB0PPS4                       703
#define RB1PPS                        704
#define RB1PPS0                       705
#define RB1PPS1                       706
#define RB1PPS2                       707
#define RB1PPS3                       708
#define RB1PPS4                       709
#define RB2PPS                        710
#define RB2PPS0                       711
#define RB2PPS1                       712
#define RB2PPS2                       713
#define RB2PPS3                       714
#define RB2PPS4                       715
#define RB3PPS                        716
#define RB3PPS0                       717
#define RB3PPS1                       718
#define RB3PPS2                       719
#define RB3PPS3                       720
#define RB3PPS4                       721
#define RB4PPS                        722
#define RB4PPS0                       723
#define RB4PPS1                       724
#define RB4PPS2                       725
#define RB4PPS3                       726
#define RB4PPS4                       727
#define RB5PPS                        728
#define RB5PPS0                       729
#define RB5PPS1                       730
#define RB5PPS2                       731
#define RB5PPS3                       732
#define RB5PPS4                       733
#define RB6PPS                        734
#define RB6PPS0                       735
#define RB6PPS1                       736
#define RB6PPS2                       737
#define RB6PPS3                       738
#define RB6PPS4                       739
#define RB7PPS                        740
#define RB7PPS0                       741
#define RB7PPS1                       742
#define RB7PPS2                       743
#define RB7PPS3                       744
#define RB7PPS4                       745
#define RC0PPS                        746
#define RC0PPS0                       747
#define RC0PPS1                       748
#define RC0PPS2                       749
#define RC0PPS3                       750
#define RC0PPS4                       751
#define RC1PPS                        752
#define RC1PPS0                       753
#define RC1PPS1                       754
#define RC1PPS2                       755
#define RC1PPS3                       756
#define RC1PPS4                       757
#define RC2PPS                        758
#define RC2PPS0                       759
#define RC2PPS1                       760
#define RC2PPS2                       761
#define RC2PPS3                       762
#define RC2PPS4                       763
#define RC3PPS                        764
#define RC3PPS0                       765
#define RC3PPS1                       766
#define RC3PPS2                       767
#define RC3PPS3                       768
#define RC3PPS4                       769
#define RC4PPS                        770
#define RC4PPS0                       771
#define RC4PPS1                       772
#define RC4PPS2                       773
#define RC4PPS3                       774
#define RC4PPS4                       775
#define RC5PPS                        776
#define RC5PPS0                       777
#define RC5PPS1                       778
#define RC5PPS2                       779
#define RC5PPS3                       780
#define RC5PPS4                       781
#define RC6PPS                        782
#define RC6PPS0                       783
#define RC6PPS1                       784
#define RC6PPS2                       785
#define RC6PPS3                       786
#define RC6PPS4                       787
#define RC7PPS                        788
#define RC7PPS0                       789
#define RC7PPS1                       790
#define RC7PPS2                       791
#define RC7PPS3                       792
#define RC7PPS4                       793
#define IOCAF                         794
#define IOCAF0                        795
#define IOCAF1                        796
#define IOCAF2                        797
#define IOCAF3                        798
#define IOCAF4                        799
#define IOCAF5                        800
#define IOCAF6                        801
#define IOCAF7                        802
#define IOCAN                         803
#define IOCAN0                        804
#define IOCAN1                        805
#define IOCAN2                        806
#define IOCAN3                        807
#define IOCAN4                        808
#define IOCAN5                        809
#define IOCAN6                        810
#define IOCAN7                        811
#define IOCAP                         812
#define IOCAP0                        813
#define IOCAP1                        814
#define IOCAP2                        815
#define IOCAP3                        816
#define IOCAP4                        817
#define IOCAP5                        818
#define IOCAP6                        819
#define IOCAP7                        820
#define INLVLA                        821
#define INLVLA0                       822
#define INLVLA1                       823
#define INLVLA2                       824
#define INLVLA3                       825
#define INLVLA4                       826
#define INLVLA5                       827
#define INLVLA6                       828
#define INLVLA7                       829
#define SLRCONA                       830
#define SLRA0                         831
#define SLRA1                         832
#define SLRA2                         833
#define SLRA3                         834
#define SLRA4                         835
#define SLRA5                         836
#define SLRA6                         837
#define SLRA7                         838
#define ODCONA                        839
#define ODCA0                         840
#define ODCA1                         841
#define ODCA2                         842
#define ODCA3                         843
#define ODCA4                         844
#define ODCA5                         845
#define ODCA6                         846
#define ODCA7                         847
#define WPUA                          848
#define WPUA0                         849
#define WPUA1                         850
#define WPUA2                         851
#define WPUA3                         852
#define WPUA4                         853
#define WPUA5                         854
#define WPUA6                         855
#define WPUA7                         856
#define ANSELA                        857
#define ANSELA0                       858
#define ANSELA1                       859
#define ANSELA2                       860
#define ANSELA3                       861
#define ANSELA4                       862
#define ANSELA5                       863
#define ANSELA6                       864
#define ANSELA7                       865
#define IOCBF                         866
#define IOCBF0                        867
#define IOCBF1                        868
#define IOCBF2                        869
#define IOCBF3                        870
#define IOCBF4                        871
#define IOCBF5                        872
#define IOCBF6                        873
#define IOCBF7                        874
#define IOCBN                         875
#define IOCBN0                        876
#define IOCBN1                        877
#define IOCBN2                        878
#define IOCBN3                        879
#define IOCBN4                        880
#define IOCBN5                        881
#define IOCBN6                        882
#define IOCBN7                        883
#define IOCBP                         884
#define IOCBP0                        885
#define IOCBP1                        886
#define IOCBP2                        887
#define IOCBP3                        888
#define IOCBP4                        889
#define IOCBP5                        890
#define IOCBP6                        891
#define IOCBP7                        892
#define INLVLB                        893
#define INLVLB0                       894
#define INLVLB1                       895
#define INLVLB2                       896
#define INLVLB3                       897
#define INLVLB4                       898
#define INLVLB5                       899
#define INLVLB6                       900
#define INLVLB7                       901
#define SLRCONB                       902
#define SLRB0                         903
#define SLRB1                         904
#define SLRB2                         905
#define SLRB3                         906
#define SLRB4                         907
#define SLRB5                         908
#define SLRB6                         909
#define SLRB7                         910
#define ODCONB                        911
#define ODCB0                         912
#define ODCB1                         913
#define ODCB2                         914
#define ODCB3                         915
#define ODCB4                         916
#define ODCB5                         917
#define ODCB6                         918
#define ODCB7                         919
#define WPUB                          920
#define WPUB0                         921
#define WPUB1                         922
#define WPUB2                         923
#define WPUB3                         924
#define WPUB4                         925
#define WPUB5                         926
#define WPUB6                         927
#define WPUB7                         928
#define ANSELB                        929
#define ANSELB0                       930
#define ANSELB1                       931
#define ANSELB2                       932
#define ANSELB3                       933
#define ANSELB4                       934
#define ANSELB5                       935
#define ANSELB6                       936
#define ANSELB7                       937
#define IOCCF                         938
#define IOCCF0                        939
#define IOCCF1                        940
#define IOCCF2                        941
#define IOCCF3                        942
#define IOCCF4                        943
#define IOCCF5                        944
#define IOCCF6                        945
#define IOCCF7                        946
#define IOCCN                         947
#define IOCCN0                        948
#define IOCCN1                        949
#define IOCCN2                        950
#define IOCCN3                        951
#define IOCCN4                        952
#define IOCCN5                        953
#define IOCCN6                        954
#define IOCCN7                        955
#define IOCCP                         956
#define IOCCP0                        957
#define IOCCP1                        958
#define IOCCP2                        959
#define IOCCP3                        960
#define IOCCP4                        961
#define IOCCP5                        962
#define IOCCP6                        963
#define IOCCP7                        964
#define INLVLC                        965
#define INLVLC0                       966
#define INLVLC1                       967
#define INLVLC2                       968
#define INLVLC3                       969
#define INLVLC4                       970
#define INLVLC5                       971
#define INLVLC6                       972
#define INLVLC7                       973
#define SLRCONC                       974
#define SLRC0                         975
#define SLRC1                         976
#define SLRC2                         977
#define SLRC3                         978
#define SLRC4                         979
#define SLRC5                         980
#define SLRC6                         981
#define SLRC7                         982
#define ODCONC                        983
#define ODCC0                         984
#define ODCC1                         985
#define ODCC2                         986
#define ODCC3                         987
#define ODCC4                         988
#define ODCC5                         989
#define ODCC6                         990
#define ODCC7                         991
#define WPUC                          992
#define WPUC0                         993
#define WPUC1                         994
#define WPUC2                         995
#define WPUC3                         996
#define WPUC4                         997
#define WPUC5                         998
#define WPUC6                         999
#define WPUC7                         1000
#define ANSELC                        1001
#define ANSELC0                       1002
#define ANSELC1                       1003
#define ANSELC2                       1004
#define ANSELC3                       1005
#define ANSELC4                       1006
#define ANSELC5                       1007
#define ANSELC6                       1008
#define ANSELC7                       1009
#define IOCEF                         1010
#define IOCEF3                        1011
#define IOCEN                         1012
#define IOCEN3                        1013
#define IOCEP                         1014
#define IOCEP3                        1015
#define INLVLE                        1016
#define INLVLE3                       1017
#define WPUE                          1018
#define WPUE3                         1019
#define HLVDCON0                      1020
#define INTL                          1021
#define HLVDINTL                      1022
#define INTH                          1023
#define HLVDINTH                      1024
#define RDY                           1025
#define HLVDRDY                       1026
#define HLVDCON0_OUT                  1027
#define HLVDOUT                       1028
#define HLVDEN                        1029
#define HLVDCON0_EN                   1030
#define HLVDCON1                      1031
#define HLVDSEL0                      1032
#define SEL                           1033
#define SEL0                          1034
#define HLVDSEL1                      1035
#define SEL1                          1036
#define HLVDSEL2                      1037
#define SEL2                          1038
#define HLVDSEL3                      1039
#define SEL3                          1040
#define FVRCON                        1041
#define ADFVR0                        1042
#define ADFVR                         1043
#define ADFVR1                        1044
#define CDAFVR                        1045
#define CDAFVR0                       1046
#define CDAFVR1                       1047
#define TSRNG                         1048
#define TSEN                          1049
#define FVRRDY                        1050
#define FVREN                         1051
#define ZCDCON                        1052
#define ZCDINTN                       1053
#define ZCDINTP                       1054
#define ZCDPOL                        1055
#define ZCDOUT                        1056
#define ZCDSEN                        1057
#define DAC1CON0                      1058
#define NSS                           1059
#define DAC1NSS                       1060
#define DAC1PSS0                      1061
#define PSS                           1062
#define PSS0                          1063
#define PSS1                          1064
#define DAC1PSS1                      1065
#define OE2                           1066
#define DAC1OE2                       1067
#define OE1                           1068
#define DAC1OE1                       1069
#define DAC1CON0_EN                   1070
#define DAC1EN                        1071
#define DAC1CON1                      1072
#define DAC1R                         1073
#define DAC1R0                        1074
#define DAC1R1                        1075
#define DAC1R2                        1076
#define DAC1R3                        1077
#define DAC1R4                        1078
#define CM2CON0                       1079
#define CM2CON0_SYNC                  1080
#define C2SYNC                        1081
#define C2HYS                         1082
#define CM2CON0_HYS                   1083
#define C2POL                         1084
#define CM2CON0_POL                   1085
#define C2OUT                         1086
#define CM2CON0_OUT                   1087
#define CM2CON0_EN                    1088
#define C2EN                          1089
#define CM2CON1                       1090
