tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf26k40_tdd.h
#define C2INTN                        1091
#define CM2CON1_INTN                  1092
#define CM2CON1_INTP                  1093
#define C2INTP                        1094
#define CM2NCH                        1095
#define C2NCH0                        1096
#define CM2NCH_NCH0                   1097
#define CM2NCH_NCH                    1098
#define C2NCH1                        1099
#define CM2NCH_NCH1                   1100
#define C2NCH2                        1101
#define CM2NCH_NCH2                   1102
#define CM2PCH                        1103
#define CM2PCH_PCH                    1104
#define C2PCH0                        1105
#define CM2PCH_PCH0                   1106
#define C2PCH1                        1107
#define CM2PCH_PCH1                   1108
#define C2PCH2                        1109
#define CM2PCH_PCH2                   1110
#define CM1CON0                       1111
#define CM1CON0_SYNC                  1112
#define C1SYNC                        1113
#define CM1CON0_HYS                   1114
#define C1HYS                         1115
#define CM1CON0_POL                   1116
#define C1POL                         1117
#define C1OUT                         1118
#define CM1CON0_OUT                   1119
#define CM1CON0_EN                    1120
#define C1EN                          1121
#define CM1CON1                       1122
#define C1INTN                        1123
#define CM1CON1_INTN                  1124
#define CM1CON1_INTP                  1125
#define C1INTP                        1126
#define CM1NCH                        1127
#define C1NCH0                        1128
#define CM1NCH_NCH0                   1129
#define CM1NCH_NCH                    1130
#define C1NCH1                        1131
#define CM1NCH_NCH1                   1132
#define C1NCH2                        1133
#define CM1NCH_NCH2                   1134
#define CM1PCH                        1135
#define CM1PCH_PCH0                   1136
#define C1PCH0                        1137
#define CM1PCH_PCH                    1138
#define CM1PCH_PCH1                   1139
#define C1PCH1                        1140
#define CM1PCH_PCH2                   1141
#define C1PCH2                        1142
#define CMOUT                         1143
#define MC1OUT                        1144
#define MC2OUT                        1145
#define CLKRCON                       1146
#define CLKRDIV0                      1147
#define DIV                           1148
#define DIV0                          1149
#define CLKRDIV1                      1150
#define DIV1                          1151
#define DIV2                          1152
#define CLKRDIV2                      1153
#define CLKRCON_DC                    1154
#define CLKRCON_DC0                   1155
#define CLKRDC0                       1156
#define CLKRCON_DC1                   1157
#define CLKRDC1                       1158
#define CLKRCON_EN                    1159
#define CLKREN                        1160
#define CLKRCLK                       1161
#define CLKRCLK0                      1162
#define CLK                           1163
#define CLK0                          1164
#define CLKRCLK1                      1165
#define CLK1                          1166
#define CLKRCLK2                      1167
#define CLK2                          1168
#define CWG1CLKCON                    1169
#define CWG1CLKCON_CS                 1170
#define CWG1CS                        1171
#define CWG1ISM                       1172
#define CWG1ISM0                      1173
#define IS                            1174
#define CWG1ISM1                      1175
#define CWG1ISM2                      1176
#define CWG1ISM3                      1177
#define CWG1DBR0                      1178
#define CWG1DBR                       1179
#define DBR                           1180
#define DBR0                          1181
#define CWG1DBR1                      1182
#define DBR1                          1183
#define CWG1DBR2                      1184
#define DBR2                          1185
#define CWG1DBR3                      1186
#define DBR3                          1187
#define CWG1DBR4                      1188
#define DBR4                          1189
#define CWG1DBR5                      1190
#define DBR5                          1191
#define CWG1DBF                       1192
#define CWG1DBF0                      1193
#define DBF                           1194
#define DBF0                          1195
#define CWG1DBF1                      1196
#define DBF1                          1197
#define CWG1DBF2                      1198
#define DBF2                          1199
#define CWG1DBF3                      1200
#define DBF3                          1201
#define CWG1DBF4                      1202
#define DBF4                          1203
#define DBF5                          1204
#define CWG1DBF5                      1205
#define CWG1CON0                      1206
#define CWG1MODE0                     1207
#define CWG1CON0_MODE                 1208
#define CWG1CON0_MODE0                1209
#define CWG1MODE                      1210
#define CWG1MODE1                     1211
#define CWG1CON0_MODE1                1212
#define CWG1MODE2                     1213
#define CWG1CON0_MODE2                1214
#define LD                            1215
#define CWG1LD                        1216
#define CWG1EN                        1217
#define G1EN                          1218
#define CWG1CON0_EN                   1219
#define CWG1CON1                      1220
#define CWG1POLA                      1221
#define POLA                          1222
#define CWG1POLB                      1223
#define POLB                          1224
#define CWG1POLC                      1225
#define POLC                          1226
#define CWG1POLD                      1227
#define POLD                          1228
#define IN                            1229
#define CWG1IN                        1230
#define CWG1AS0                       1231
#define CWG1LSAC                      1232
#define LSAC                          1233
#define LSAC0                         1234
#define CWG1LSAC0                     1235
#define LSAC1                         1236
#define CWG1LSAC1                     1237
#define LSBD0                         1238
#define CWG1LSBD0                     1239
#define LSBD                          1240
#define CWG1LSBD                      1241
#define LSBD1                         1242
#define CWG1LSBD1                     1243
#define CWG1REN                       1244
#define REN                           1245
#define CWG1SHUTDOWN                  1246
#define SHUTDOWN                      1247
#define CWG1AS1                       1248
#define AS0E                          1249
#define AS1E                          1250
#define AS2E                          1251
#define AS3E                          1252
#define AS4E                          1253
#define AS5E                          1254
#define CWG1STR                       1255
#define CWG1STRA                      1256
#define STRA                          1257
#define STRB                          1258
#define CWG1STRB                      1259
#define CWG1STRC                      1260
#define STRC                          1261
#define CWG1STRD                      1262
#define STRD                          1263
#define OVRA                          1264
#define CWG1OVRA                      1265
#define CWG1OVRB                      1266
#define OVRB                          1267
#define OVRC                          1268
#define CWG1OVRC                      1269
#define OVRD                          1270
#define CWG1OVRD                      1271
#define SCANLADRL                     1272
#define SCANLADRL_LADR                1273
#define SCANLADRL_SCANLADR            1274
#define LADR0                         1275
#define SCANLADR0                     1276
#define SCANLADR1                     1277
#define LADR1                         1278
#define LADR2                         1279
#define SCANLADR2                     1280
#define LADR3                         1281
#define SCANLADR3                     1282
#define LADR4                         1283
#define SCANLADR4                     1284
#define LADR5                         1285
#define SCANLADR5                     1286
#define SCANLADR6                     1287
#define LADR6                         1288
#define LADR7                         1289
#define SCANLADR7                     1290
#define SCANLADRH                     1291
#define LADR8                         1292
#define SCANLADRH_SCANLADR            1293
#define SCANLADR8                     1294
#define SCANLADRH_LADR                1295
#define LADR9                         1296
#define SCANLADR9                     1297
#define LADR10                        1298
#define SCANLADR10                    1299
#define SCANLADR11                    1300
#define LADR11                        1301
#define LADR12                        1302
#define SCANLADR12                    1303
#define LADR13                        1304
#define SCANLADR13                    1305
#define LADR14                        1306
#define SCANLADR14                    1307
#define LADR15                        1308
#define SCANLADR15                    1309
#define SCANLADRU                     1310
#define LADR16                        1311
#define SCANLADR16                    1312
#define SCANLADRU_SCANLADR            1313
#define SCANLADRU_LADR                1314
#define SCANLADR17                    1315
#define LADR17                        1316
#define LADR18                        1317
#define SCANLADR18                    1318
#define LADR19                        1319
#define SCANLADR19                    1320
#define SCANLADR20                    1321
#define LADR20                        1322
#define SCANLADR21                    1323
#define LADR21                        1324
#define SCANHADRL                     1325
#define SCANHADR0                     1326
#define HADR0                         1327
#define SCANHADRL_HADR                1328
#define SCANHADRL_SCANHADR            1329
#define SCANHADR1                     1330
#define HADR1                         1331
#define SCANHADR2                     1332
#define HADR2                         1333
#define SCANHADR3                     1334
#define HADR3                         1335
#define SCANHADR4                     1336
#define HADR4                         1337
#define SCANHADR5                     1338
#define HADR5                         1339
#define SCANHADR6                     1340
#define HADR6                         1341
#define SCANHADR7                     1342
#define HADR7                         1343
#define SCANHADRH                     1344
#define HADR8                         1345
#define SCANHADRH_SCANHADR            1346
#define SCANHADR8                     1347
#define SCANHADRH_HADR                1348
#define HADR9                         1349
#define SCANHADR9                     1350
#define HADR10                        1351
#define SCANHADR10                    1352
#define SCANHADR11                    1353
#define HADR11                        1354
#define HADR12                        1355
#define SCANHADR12                    1356
#define HADR13                        1357
#define SCANHADR13                    1358
#define HADR14                        1359
#define SCANHADR14                    1360
#define HADR15                        1361
#define SCANHADR15                    1362
#define SCANHADRU                     1363
#define SCANHADRU_SCANHADR            1364
#define SCANHADRU_HADR                1365
#define HADR16                        1366
#define SCANHADR16                    1367
#define SCANHADR17                    1368
#define HADR17                        1369
#define HADR18                        1370
#define SCANHADR18                    1371
#define HADR19                        1372
#define SCANHADR19                    1373
#define HADR20                        1374
#define SCANHADR20                    1375
#define SCANHADR21                    1376
#define HADR21                        1377
#define SCANCON0                      1378
#define SCANMODE0                     1379
#define SCANCON0_MODE                 1380
#define SCANCON0_MODE0                1381
#define SCANMODE                      1382
#define SCANMODE1                     1383
#define SCANCON0_MODE1                1384
#define INTM                          1385
#define SCANINTM                      1386
#define DABORT                        1387
#define SCANINVALID                   1388
#define INVALID                       1389
#define SCANCON0_BUSY                 1390
#define SCANBUSY                      1391
#define SCANCON0_GO                   1392
#define SCANGO                        1393
#define SCANCON0_EN                   1394
#define SCANEN                        1395
#define SCANTRIG                      1396
#define TSEL0                         1397
#define TSEL                          1398
#define SCANTSEL0                     1399
#define SCANTSEL                      1400
#define TSEL1                         1401
#define SCANTSEL1                     1402
#define TSEL2                         1403
#define SCANTSEL2                     1404
#define TSEL3                         1405
#define SCANTSEL3                     1406
#define MDCON0                        1407
#define MDBIT                         1408
#define BIT                           1409
#define OPOL                          1410
#define MDOPOL                        1411
#define MDOUT                         1412
#define MDCON0_OUT                    1413
#define MDEN                          1414
#define MDCON0_EN                     1415
#define MDCON1                        1416
#define MDCLSYNC                      1417
#define CLSYNC                        1418
#define MDCLPOL                       1419
#define CLPOL                         1420
#define CHSYNC                        1421
#define MDCHSYNC                      1422
#define MDCHPOL                       1423
#define CHPOL                         1424
#define MDSRC                         1425
#define SRCS0                         1426
#define MDSRCS                        1427
#define SRCS                          1428
#define MDSRCS0                       1429
#define SRCS1                         1430
#define MDSRCS1                       1431
#define SRCS2                         1432
#define MDSRCS2                       1433
#define SRCS3                         1434
#define MDSRCS3                       1435
#define MDCARL                        1436
#define CLS0                          1437
#define MDCLS                         1438
#define MDCLS0                        1439
#define CLS                           1440
#define CLS1                          1441
#define MDCLS1                        1442
#define CLS2                          1443
#define MDCLS2                        1444
#define MDCARH                        1445
#define CHS0                          1446
#define CHS                           1447
#define MDCHS                         1448
#define MDCHS0                        1449
#define CHS1                          1450
#define MDCHS1                        1451
#define CHS2                          1452
#define MDCHS2                        1453
#define ADACT0                        1454
#define ADACT                         1455
#define ADACT1                        1456
#define ADACT2                        1457
#define ADACT3                        1458
#define ADACT4                        1459
#define ADCLK                         1460
#define ADCS0                         1461
#define ADCLK_ADCS                    1462
#define ADCS1                         1463
#define ADCS2                         1464
#define ADCS3                         1465
#define ADCS4                         1466
#define ADCS5                         1467
#define ADREF                         1468
#define ADPREF                        1469
#define ADPREF0                       1470
#define ADPREF1                       1471
#define ADNREF                        1472
#define ADCON1                        1473
#define ADDSEN                        1474
#define NVCFG0                        1475
#define NVCFG1                        1476
#define PVCFG0                        1477
#define CHSN3                         1478
#define PVCFG1                        1479
#define VCFG11                        1480
#define ADGPOL                        1481
#define ADIPEN                        1482
#define ADPPOL                        1483
#define ADCON2                        1484
#define ADMD                          1485
#define ADMD0                         1486
#define ADMD1                         1487
#define ADMD2                         1488
#define ADACLR                        1489
#define ADCRS                         1490
#define ADCRS0                        1491
#define ADCRS1                        1492
#define ADCRS2                        1493
#define ADPSIS                        1494
#define ADCON3                        1495
#define ADTMD                         1496
#define ADTMD0                        1497
#define ADTMD1                        1498
#define ADTMD2                        1499
#define ADSOI                         1500
#define ADCALC                        1501
#define ADCALC0                       1502
#define ADCALC1                       1503
#define ADCALC2                       1504
#define ADACQ                         1505
#define ADACQ0                        1506
#define ADACQ1                        1507
#define ADACQ2                        1508
#define ADACQ3                        1509
#define ADACQ4                        1510
#define ADACQ5                        1511
#define ADACQ6                        1512
#define ADACQ7                        1513
#define ADCAP                         1514
#define ADCAP0                        1515
#define ADCAP1                        1516
#define ADCAP2                        1517
#define ADCAP3                        1518
#define ADCAP4                        1519
#define ADPRE0                        1520
#define ADPRE                         1521
#define ADPRE1                        1522
#define ADPRE2                        1523
#define ADPRE3                        1524
#define ADPRE4                        1525
#define ADPRE5                        1526
#define ADPRE6                        1527
#define ADPRE7                        1528
#define ADPCH                         1529
#define ADPCH0                        1530
#define ADPCH1                        1531
#define ADPCH2                        1532
#define ADPCH3                        1533
#define ADPCH4                        1534
#define ADPCH5                        1535
#define ADCON0                        1536
#define ADCON0_GO                     1537
#define DONE                          1538
#define GO_NOT_DONE                   1539
#define GO_nDONE                      1540
#define ADGO                          1541
#define GODONE                        1542
#define ADFM                          1543
#define ADFM0                         1544
#define ADCON0_ADCS                   1545
#define ADCONT                        1546
#define ADCAL                         1547
#define ADON                          1548
#define ADPREVL                       1549
#define ADPREV0                       1550
#define ADPREV1                       1551
#define ADPREV2                       1552
#define ADPREV3                       1553
#define ADPREV4                       1554
#define ADPREV5                       1555
#define ADPREV6                       1556
#define ADPREV7                       1557
#define ADPREVH                       1558
#define ADPREV8                       1559
#define ADPREV9                       1560
#define ADPREV10                      1561
#define ADPREV11                      1562
#define ADPREV12                      1563
#define ADPREV13                      1564
#define ADPREV14                      1565
#define ADPREV15                      1566
#define ADRESL                        1567
#define ADRES0                        1568
#define ADRES1                        1569
#define ADRES2                        1570
#define ADRES3                        1571
#define ADRES4                        1572
#define ADRES5                        1573
#define ADRES6                        1574
#define ADRES7                        1575
#define ADRESH                        1576
#define ADRES8                        1577
#define ADRES9                        1578
#define ADRES10                       1579
#define ADRES11                       1580
#define ADRES12                       1581
#define ADRES13                       1582
#define ADRES14                       1583
#define ADRES15                       1584
#define ADSTAT                        1585
#define ADSTAT0                       1586
#define ADSTAT1                       1587
#define ADSTAT2                       1588
#define ADMATH                        1589
#define ADLTHR                        1590
#define ADUTHR                        1591
#define ADAOV                         1592
#define ADRPT0                        1593
#define ADRPT                         1594
#define ADRPT1                        1595
#define ADRPT2                        1596
#define ADRPT3                        1597
#define ADRPT4                        1598
#define ADRPT5                        1599
#define ADRPT6                        1600
#define ADRPT7                        1601
#define ADCNT0                        1602
#define ADCNT                         1603
#define ADCNT1                        1604
#define ADCNT2                        1605
#define ADCNT3                        1606
#define ADCNT4                        1607
#define ADCNT5                        1608
#define ADCNT6                        1609
#define ADCNT7                        1610
#define ADSTPT0                       1611
#define ADSTPTL                       1612
#define ADSTPT1                       1613
#define ADSTPT2                       1614
#define ADSTPT3                       1615
#define ADSTPT4                       1616
#define ADSTPT5                       1617
#define ADSTPT6                       1618
#define ADSTPT7                       1619
#define ADSTPT8                       1620
#define ADSTPTH                       1621
#define ADSTPT9                       1622
#define ADSTPT10                      1623
#define ADSTPT11                      1624
#define ADSTPT12                      1625
#define ADSTPT13                      1626
#define ADSTPT14                      1627
#define ADSTPT15                      1628
#define ADLTH0                        1629
#define ADLTHL                        1630
#define ADLTH1                        1631
#define ADLTH2                        1632
#define ADLTH3                        1633
#define ADLTH4                        1634
#define ADLTH5                        1635
#define ADLTH6                        1636
#define ADLTH7                        1637
#define ADLTH8                        1638
#define ADLTHH                        1639
#define ADLTH9                        1640
#define ADLTH10                       1641
#define ADLTH11                       1642
#define ADLTH12                       1643
#define ADLTH13                       1644
#define ADLTH14                       1645
#define ADLTH15                       1646
#define ADUTH0                        1647
#define ADUTHL                        1648
