tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf26k40_tdd.h
#define ADUTH1                        1649
#define ADUTH2                        1650
#define ADUTH3                        1651
#define ADUTH4                        1652
#define ADUTH5                        1653
#define ADUTH6                        1654
#define ADUTH7                        1655
#define ADUTH8                        1656
#define ADUTHH                        1657
#define ADUTH9                        1658
#define ADUTH10                       1659
#define ADUTH11                       1660
#define ADUTH12                       1661
#define ADUTH13                       1662
#define ADUTH14                       1663
#define ADUTH15                       1664
#define ADERR0                        1665
#define ADERRL                        1666
#define ADERR1                        1667
#define ADERR2                        1668
#define ADERR3                        1669
#define ADERR4                        1670
#define ADERR5                        1671
#define ADERR6                        1672
#define ADERR7                        1673
#define ADERR8                        1674
#define ADERRH                        1675
#define ADERR9                        1676
#define ADERR10                       1677
#define ADERR11                       1678
#define ADERR12                       1679
#define ADERR13                       1680
#define ADERR14                       1681
#define ADERR15                       1682
#define ADACC0                        1683
#define ADACCL                        1684
#define ADACC1                        1685
#define ADACC2                        1686
#define ADACC3                        1687
#define ADACC4                        1688
#define ADACC5                        1689
#define ADACC6                        1690
#define ADACC7                        1691
#define ADACC8                        1692
#define ADACCH                        1693
#define ADACC9                        1694
#define ADACC10                       1695
#define ADACC11                       1696
#define ADACC12                       1697
#define ADACC13                       1698
#define ADACC14                       1699
#define ADACC15                       1700
#define ADFLTR0                       1701
#define ADFLTRL                       1702
#define ADFLTR1                       1703
#define ADFLTR2                       1704
#define ADFLTR3                       1705
#define ADFLTR4                       1706
#define ADFLTR5                       1707
#define ADFLTR6                       1708
#define ADFLTR7                       1709
#define ADFLTR8                       1710
#define ADFLTRH                       1711
#define ADFLTR9                       1712
#define ADFLTR10                      1713
#define ADFLTR11                      1714
#define ADFLTR12                      1715
#define ADFLTR13                      1716
#define ADFLTR14                      1717
#define ADFLTR15                      1718
#define CRCDATL                       1719
#define DATA0                         1720
#define DATA1                         1721
#define DATA2                         1722
#define DATA3                         1723
#define DATA4                         1724
#define DATA5                         1725
#define DATA6                         1726
#define DATA7                         1727
#define CRCDATH                       1728
#define DATA8                         1729
#define DATA9                         1730
#define DATA10                        1731
#define DATA11                        1732
#define DATA12                        1733
#define DATA13                        1734
#define DATA14                        1735
#define DATA15                        1736
#define CRCACCL                       1737
#define ACC0                          1738
#define ACC1                          1739
#define ACC2                          1740
#define ACC3                          1741
#define ACC4                          1742
#define ACC5                          1743
#define ACC6                          1744
#define ACC7                          1745
#define CRCACCH                       1746
#define ACC8                          1747
#define ACC9                          1748
#define ACC10                         1749
#define ACC11                         1750
#define ACC12                         1751
#define ACC13                         1752
#define ACC14                         1753
#define ACC15                         1754
#define CRCSHIFTL                     1755
#define SHFT0                         1756
#define SHFT1                         1757
#define SHFT2                         1758
#define SHFT3                         1759
#define SHFT4                         1760
#define SHFT5                         1761
#define SHFT6                         1762
#define SHFT7                         1763
#define CRCSHIFTH                     1764
#define SHFT8                         1765
#define SHFT9                         1766
#define SHFT10                        1767
#define SHFT11                        1768
#define SHFT12                        1769
#define SHFT13                        1770
#define SHFT14                        1771
#define SHFT15                        1772
#define CRCXORL                       1773
#define X1                            1774
#define X2                            1775
#define X3                            1776
#define X4                            1777
#define X5                            1778
#define X6                            1779
#define X7                            1780
#define CRCXORH                       1781
#define X8                            1782
#define X9                            1783
#define X10                           1784
#define X11                           1785
#define X12                           1786
#define X13                           1787
#define X14                           1788
#define X15                           1789
#define CRCCON0                       1790
#define FULL                          1791
#define SHIFTM                        1792
#define ACCM                          1793
#define CRCCON0_BUSY                  1794
#define CRCGO                         1795
#define CRCCON0_EN                    1796
#define CRCEN                         1797
#define CRCCON1                       1798
#define PLEN0                         1799
#define PLEN                          1800
#define PLEN1                         1801
#define PLEN2                         1802
#define PLEN3                         1803
#define DLEN                          1804
#define DLEN0                         1805
#define DLEN1                         1806
#define DLEN2                         1807
#define DLEN3                         1808
#define NVMADRL                       1809
#define ADR0                          1810
#define ADR                           1811
#define NVMADR0                       1812
#define ADR1                          1813
#define NVMADR1                       1814
#define ADR2                          1815
#define NVMADR2                       1816
#define ADR3                          1817
#define NVMADR3                       1818
#define ADR4                          1819
#define NVMADR4                       1820
#define NVMADR5                       1821
#define ADR5                          1822
#define ADR6                          1823
#define NVMADR6                       1824
#define ADR7                          1825
#define NVMADR7                       1826
#define NVMADRH                       1827
#define ADRH                          1828
#define NVMADR8                       1829
#define ADR8                          1830
#define ADR9                          1831
#define NVMADR9                       1832
#define NVMDAT0                       1833
#define NVMDAT                        1834
#define NVMDAT1                       1835
#define NVMDAT2                       1836
#define NVMDAT3                       1837
#define NVMDAT4                       1838
#define NVMDAT5                       1839
#define NVMDAT6                       1840
#define NVMDAT7                       1841
#define NVMCON1                       1842
#define RD                            1843
#define WR                            1844
#define WREN                          1845
#define WRERR                         1846
#define FREE                          1847
#define NVMREG                        1848
#define NVMREG0                       1849
#define NVMREG1                       1850
#define NVMCON2                       1851
#define LATA                          1852
#define LATA0                         1853
#define LA0                           1854
#define LATA1                         1855
#define LA1                           1856
#define LATA2                         1857
#define LA2                           1858
#define LATA3                         1859
#define LA3                           1860
#define LATA4                         1861
#define LA4                           1862
#define LATA5                         1863
#define LA5                           1864
#define LATA6                         1865
#define LA6                           1866
#define LATA7                         1867
#define LA7                           1868
#define LATB                          1869
#define LB0                           1870
#define LATB0                         1871
#define LB1                           1872
#define LATB1                         1873
#define LB2                           1874
#define LATB2                         1875
#define LB3                           1876
#define LATB3                         1877
#define LB4                           1878
#define LATB4                         1879
#define LB5                           1880
#define LATB5                         1881
#define LB6                           1882
#define LATB6                         1883
#define LB7                           1884
#define LATB7                         1885
#define LATC                          1886
#define LATC0                         1887
#define LC0                           1888
#define LATC1                         1889
#define LC1                           1890
#define LATC2                         1891
#define LC2                           1892
#define LATC3                         1893
#define LC3                           1894
#define LATC4                         1895
#define LC4                           1896
#define LATC5                         1897
#define LC5                           1898
#define LATC6                         1899
#define LC6                           1900
#define LATC7                         1901
#define LC7                           1902
#define TRISA                         1903
#define TRISA0                        1904
#define TRISA1                        1905
#define TRISA2                        1906
#define TRISA3                        1907
#define TRISA4                        1908
#define TRISA5                        1909
#define TRISA6                        1910
#define TRISA7                        1911
#define TRISB                         1912
#define TRISB0                        1913
#define TRISB1                        1914
#define TRISB2                        1915
#define TRISB3                        1916
#define TRISB4                        1917
#define TRISB5                        1918
#define TRISB6                        1919
#define TRISB7                        1920
#define TRISC                         1921
#define TRISC0                        1922
#define TRISC1                        1923
#define TRISC2                        1924
#define TRISC3                        1925
#define TRISC4                        1926
#define TRISC5                        1927
#define TRISC6                        1928
#define TRISC7                        1929
#define PORTA                         1930
#define ULPWUIN                       1931
#define RA0                           1932
#define RA1                           1933
#define RA2                           1934
#define RA3                           1935
#define RA4                           1936
#define LVDIN                         1937
#define RA5                           1938
#define RA6                           1939
#define RA7                           1940
#define RJPU                          1941
#define PORTB                         1942
#define RB0                           1943
#define RB1                           1944
#define RB2                           1945
#define CCP2_PA2                      1946
#define RB3                           1947
#define RB4                           1948
#define RB5                           1949
#define RB6                           1950
#define RB7                           1951
#define PORTC                         1952
#define RC0                           1953
#define PA2                           1954
#define RC1                           1955
#define CCP2                          1956
#define PA1                           1957
#define RC2                           1958
#define RC3                           1959
#define RC4                           1960
#define RC5                           1961
#define RC6                           1962
#define RC7                           1963
#define PORTE                         1964
#define PD2                           1965
#define RDE                           1966
#define RE0                           1967
#define WRE                           1968
#define RE1                           1969
#define PC2                           1970
#define PORTE_CS                      1971
#define CCP10                         1972
#define PB2                           1973
#define RE2                           1974
#define CCP9E                         1975
#define RE3                           1976
#define PC3E                          1977
#define RE4                           1978
#define PB3E                          1979
#define CCP8E                         1980
#define CCP7E                         1981
#define RE5                           1982
#define PC1E                          1983
#define CCP6E                         1984
#define RE6                           1985
#define PB1E                          1986
#define CCP2E                         1987
#define PA2E                          1988
#define RE7                           1989
#define SSP1BUF                       1990
#define SSP1BUF_SSPBUF                1991
#define SSP1ADD                       1992
#define SSP1ADD_SSPADD                1993
#define SSP1ADD_MSK0                  1994
#define MSK01                         1995
#define SSP1ADD_MSK1                  1996
#define MSK11                         1997
#define SSP1ADD_MSK2                  1998
#define MSK21                         1999
#define MSK31                         2000
#define SSP1ADD_MSK3                  2001
#define SSP1ADD_MSK4                  2002
#define MSK41                         2003
#define MSK51                         2004
#define SSP1ADD_MSK5                  2005
#define SSP1ADD_MSK6                  2006
#define MSK61                         2007
#define MSK71                         2008
#define SSP1ADD_MSK7                  2009
#define SSP1MSK                       2010
#define SSP1MSK_MSK0                  2011
#define SSP1MSK_SSPMSK                2012
#define SSP1MSK_MSK1                  2013
#define SSP1MSK_MSK2                  2014
#define SSP1MSK_MSK3                  2015
#define SSP1MSK_MSK4                  2016
#define SSP1MSK_MSK5                  2017
#define SSP1MSK_MSK6                  2018
#define SSP1MSK_MSK7                  2019
#define SSP1STAT                      2020
#define BF1                           2021
#define SSP1STAT_BF                   2022
#define UA1                           2023
#define SSP1STAT_UA                   2024
#define SSP1STAT_R_NOT_W              2025
#define RW1                           2026
#define SSP1STAT_nW                   2027
#define RW                            2028
#define SSP1STAT_READ_WRITE           2029
#define SSP1STAT_nWRITE               2030
#define SSP1STAT_I2C_READ             2031
#define SSP1STAT_R_W                  2032
#define R                             2033
#define SSP1STAT_NOT_WRITE            2034
#define SSP1STAT_R_nW                 2035
#define SSP1STAT_S                    2036
#define START                         2037
#define START1                        2038
#define SSP1STAT_I2C_START            2039
#define STOP                          2040
#define SSP1STAT_P                    2041
#define STOP1                         2042
#define SSP1STAT_I2C_STOP             2043
#define SSP1STAT_D_NOT_A              2044
#define SSP1STAT_D_A                  2045
#define SSP1STAT_D_nA                 2046
#define SSP1STAT_NOT_ADDRESS          2047
#define SSP1STAT_DATA_ADDRESS         2048
#define SSP1STAT_nA                   2049
#define D                             2050
#define DA1                           2051
#define DA                            2052
#define SSP1STAT_nADDRESS             2053
#define SSP1STAT_I2C_DAT              2054
#define SSP1STAT_CKE                  2055
#define CKE1                          2056
#define SSP1STAT_SMP                  2057
#define SMP1                          2058
#define SSP1CON1                      2059
#define SSP1CON1_SSPM0                2060
#define SSPM01                        2061
#define SSP1CON1_SSPM                 2062
#define SSP1CON1_SSPM1                2063
#define SSPM11                        2064
#define SSP1CON1_SSPM2                2065
#define SSPM21                        2066
#define SSPM31                        2067
#define SSP1CON1_SSPM3                2068
#define SSP1CON1_CKP                  2069
#define CKP1                          2070
#define SSPEN1                        2071
#define SSP1CON1_SSPEN                2072
#define SSPOV1                        2073
#define SSP1CON1_SSPOV                2074
#define WCOL1                         2075
#define SSP1CON1_WCOL                 2076
#define SSP1CON2                      2077
#define SEN1                          2078
#define SSP1CON2_SEN                  2079
#define ADMSK11                       2080
#define SSP1CON2_RSEN                 2081
#define RSEN1                         2082
#define SSP1CON2_ADMSK1               2083
#define SSP1CON2_ADMSK                2084
#define SSP1CON2_PEN                  2085
#define ADMSK21                       2086
#define PEN1                          2087
#define SSP1CON2_ADMSK2               2088
#define ADMSK31                       2089
#define RCEN1                         2090
#define SSP1CON2_RCEN                 2091
#define SSP1CON2_ADMSK3               2092
#define SSP1CON2_ACKEN                2093
#define ACKEN1                        2094
#define ADMSK41                       2095
#define SSP1CON2_ADMSK4               2096
#define ACKDT1                        2097
#define ADMSK51                       2098
#define SSP1CON2_ACKDT                2099
#define SSP1CON2_ADMSK5               2100
#define SSP1CON2_ACKSTAT              2101
#define ACKSTAT1                      2102
#define GCEN1                         2103
#define SSP1CON2_GCEN                 2104
#define SSP1CON3                      2105
#define SSP1CON3_DHEN                 2106
#define SSP1CON3_AHEN                 2107
#define SSP1CON3_SBCDE                2108
#define SSP1CON3_SDAHT                2109
#define SSP1CON3_BOEN                 2110
#define SSP1CON3_SCIE                 2111
#define SSP1CON3_PCIE                 2112
#define SSP1CON3_ACKTIM               2113
#define RC1REG                        2114
#define TX1REG                        2115
#define SP1BRGL                       2116
#define SP1BRGH                       2117
#define RC1STA                        2118
#define RC1STA_RX9D                   2119
#define RCD8                          2120
#define RC1STA_OERR                   2121
#define RC1STA_FERR                   2122
#define RC1STA_ADDEN                  2123
#define RC1STA_CREN                   2124
#define RC1STA_SREN                   2125
#define RC1STA_RX9                    2126
#define RC8_9                         2127
#define RC9                           2128
#define RC1STA_SPEN                   2129
#define TX1STA                        2130
#define TXD8                          2131
#define TX1STA_TX9D                   2132
#define TX1STA_TRMT                   2133
#define TX1STA_BRGH                   2134
#define TX1STA_SENDB                  2135
#define TX1STA_SYNC                   2136
#define TX1STA_TXEN                   2137
#define TX1STA_TX9                    2138
#define TX8_9                         2139
#define TX1STA_CSRC                   2140
#define BAUD1CON                      2141
#define ABDEN1                        2142
#define BAUD1CON_ABDEN                2143
#define WUE1                          2144
#define BAUD1CON_WUE                  2145
#define BRG161                        2146
#define BAUD1CON_BRG16                2147
#define SCKP1                         2148
#define CKTXP                         2149
#define TXCKP                         2150
#define BAUD1CON_SCKP                 2151
#define TXCKP1                        2152
#define BAUD1CON_RCIDL                2153
#define RCMT1                         2154
#define RCIDL1                        2155
#define RCMT                          2156
#define BAUD1CON_ABDOVF               2157
#define ABDOVF1                       2158
#define PWM4DCL                       2159
#define PWM4DCL_PWMPW0                2160
#define PWM4DCL_DC                    2161
#define PWM4DC0                       2162
#define PWM4DCL_DC0                   2163
#define PWM4DCL_PWMPW1                2164
#define PWM4DC1                       2165
#define PWM4DCL_DC1                   2166
#define PWM4DCH                       2167
#define PWM4DCH_PWMPW2                2168
#define PWM4DCH_DC                    2169
#define PWM4DC2                       2170
#define PWM4DCH_DC2                   2171
#define PWM4DCH_PWMPW3                2172
#define PWM4DC3                       2173
#define PWM4DCH_DC3                   2174
#define PWM4DCH_PWMPW4                2175
#define PWM4DC4                       2176
#define PWM4DCH_DC4                   2177
#define PWM4DCH_PWMPW5                2178
#define PWM4DC5                       2179
#define PWM4DCH_DC5                   2180
#define PWM4DCH_PWMPW6                2181
#define PWM4DC6                       2182
#define PWM4DCH_DC6                   2183
#define PWM4DCH_PWMPW7                2184
#define PWM4DC7                       2185
#define PWM4DCH_DC7                   2186
#define PWM4DCH_PWMPW8                2187
#define PWM4DC8                       2188
#define PWM4DCH_DC8                   2189
#define PWM4DCH_PWMPW9                2190
#define PWM4DC9                       2191
#define PWM4DCH_DC9                   2192
#define PWM4CON                       2193
#define PWM4POL                       2194
#define PWM4CON_POL                   2195
#define PWM4CON_OUT                   2196
#define PWM4OUT                       2197
#define PWM4EN                        2198
#define PWM4CON_EN                    2199
#define PWM3DCL                       2200
#define PWM3DC0                       2201
#define PWM3DCL_PWMPW0                2202
#define PWM3DCL_DC0                   2203
#define PWM3DCL_DC                    2204
#define PWM3DC1                       2205
#define PWM3DCL_PWMPW1                2206
